In [1]:
#data processing
import pandas as pd

In [2]:
#performing algebra
import numpy as np

In [3]:
#data vitualization
import matplotlib.pyplot as pt

In [4]:
#df is data frames
df = pd.read_csv('hiring.csv')

In [5]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [10]:
#rename collumn
df.rename(columns = {'test_score(out of 10)':'test_score','interview_score(out of 10)':'interview_score','salary($)':'salary'}, inplace = True)

In [11]:
#display data frame after rename the collumn
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [12]:
import math

In [14]:
#find the medium value of test_score
NaN_test = df.test_score.median()

In [15]:
print(NaN_test)

8.0

In [17]:
#replace the NaN value at test_score collumn
df.test_score = df.test_score.fillna(NaN_test)
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [20]:
# creating a dict file  
# Experience = {'one': 1,'two': 2,'three':3,'four': 4,'five': 5,'six':6,'seven':7,'ten':10,'eleven':11}

In [23]:

#df.experience = [Experience[item] for item in df.experience] 
#df

In [24]:
df.experience

0       NaN
1       NaN
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [26]:
# traversing through Gender  
# column of dataFrame and  
# writing values where 
# condition matches. 
df.experience[df.experience == 'five'] = 5
df.experience[df.experience == 'two'] = 2
df.experience[df.experience == 'seven'] = 7
df.experience[df.experience == 'three'] = 3
df.experience[df.experience == 'ten'] = 10
df.experience[df.experience == 'eleven'] = 11
df

/home/ubuntu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """
/home/ubuntu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/home/ubuntu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  import sys
/home/ubuntu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/home/ubuntu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':
/home/ubuntu/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  # Remove the CWD from sys.path while we load stuff.

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2          5         6.0                7   60000
3          2        10.0               10   65000
4          7         9.0                6   70000
5          3         7.0               10   62000
6         10         8.0                7   72000
7         11         7.0                8   80000

In [27]:
df.experience = df.experience.fillna(df.experience.median())
df

   experience  test_score  interview_score  salary
0         6.0         8.0                9   50000
1         6.0         8.0                6   45000
2         5.0         6.0                7   60000
3         2.0        10.0               10   65000
4         7.0         9.0                6   70000
5         3.0         7.0               10   62000
6        10.0         8.0                7   72000
7        11.0         7.0                8   80000

In [28]:
from sklearn import linear_model

In [29]:
model = linear_model.LinearRegression()

In [31]:
# train the model using the training sets 
model.fit(df.drop('salary',axis="columns"),df['salary'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [33]:
#coeficient ( b1 ,b2, b3 )
model.coef_

array([2813.00813008, 1333.33333333, 2926.82926829])

In [34]:
#interception ( b0 )
model.intercept_

11869.918699186936

In [37]:
#predict salary for 10,8,7
model.predict([[10,8,7]])

array([71154.47154472])

In [38]:
from sklearn.metrics import confusion_matrix
confusion_matrix(labels_train, pred)

NameError: name 'labels_train' is not defined